Revit 2026 API
InsulationTypeSet.Erase Method
Removes a specified insulation type from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public virtual int Erase(
	InsulationType item
)
Public Overridable Function Erase (
	item As InsulationType
) As Integer
public:
virtual int Erase(
	InsulationType^ item
)
abstract Erase :
        item : InsulationType -> int
override Erase :
        item : InsulationType -> int
Parameters
item InsulationType
The insulation type to be erased.
Return Value
Int32
The number of insulation types that were erased from the set.
See Also
Reference
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace